Repository: pypi-data/pypi-mirror-336
Catalog: packages/fiduswriter-payment-paddle/fiduswriter_payment_paddle-4.0.0-py3-none-any.whl/fiduswriter/payment/locale/*/LC_MESSAGES/djangojs.po
Languages: es, pt_br

source: Subscription warning
es: Advertencia de suscripción
pt_br: Aviso de subscrição

source: You have run out of free documents. Sign up for a subscription to create more documents.
es: Te has quedado sin documentos gratis. Regístrese para obtener una suscripción para crear más documentos.
pt_br: Você ficou sem documentos gratuitos. Inscreva-se para uma subscrição para criar mais documentos.

source: Go to subscription page
es: Ir a la página de suscripción
pt_br: Ir para a página da subscrição

source: Subscription
es: Suscripción
pt_br: Subscrição

source: Plan overview
es: Planes
pt_br: Visão geral do plano

source: Modify subscription
es: Modificar suscripción
pt_br: Modificar subscrição

source: Please choose whether to update payment details or to cancel your subscription.
es: Elija si desea actualizar los detalles del pago o cancelar su suscripción.
pt_br: Escolha se deseja actualizar os detalhes do pagamento ou cancelar sua a subscrição.

source: Update payment details
es: Actualizar detalles de pago
pt_br: Atualizar detalhes do pagamento

source: Cancel subscription
es: Cancelar suscripción
pt_br: Cancelar subscrição

source: Plan change not possible
es: No es posible realizar el cambio de plan
pt_br: Não é possível alterar o plano

source: Unfortunately it is not possible to switch plans during the trial period.
es: Lamentablemente, no es posible cambiar de plan durante el periodo de prueba.
pt_br: Infelizmente, não é possível mudar de planos durante o periodo experimental.

source: Switch subscription
es: Cambiar suscripción
pt_br: Alterar subscrição

source: Do you really want to switch your subscription type?
es: ¿Realmente quiere cambiar su tipo de suscripción?
pt_br: Deseja realmente mudar seu tipo de subscrição?

source: Yes
es: Sí
pt_br: sim

source: Pricing
es: Precios
pt_br: Preços

source: Pricing Guide
es: Guía de precios
pt_br: Guia de preços

source: You can write 2 documents on the Free Plan without any trial period.
es: Puede escribir 2 documentos en el Plan gratuito sin ningún periodo de prueba.
pt_br: Você pode escrever 2 documentos no Plano Gratuito sem periodo de teste.

source: If you want to write more documents, you can upgrade your plan below.
es: Si desea escribir más documentos, puede elegir un plan a continuación.
pt_br: Se você deseja escrever mais documentos, pode atualizar seu plano abaixo.

source: Basic
es: Básico
pt_br: Básico

source: Free Plan
es: Plan gratuito
pt_br: Plano grátis

source: 2 free documents
es: 2 documentos gratis
pt_br: 2 documentos gratuitos

source: Unlimited collaborators
es: Colaboradores ilimitados
pt_br: Colaboradores ilimitados

source: Unlimited bibliography items
es: Artículos de bibliografía ilimitados
pt_br: Itens de bibliografia ilimitados

source: Unlimited exports
es: Exportaciones ilimitadas
pt_br: Exportações ilimitadas

source: Default
es: Gratuito
pt_br: Padrão

source: Downgrade on
es: Se activa el
pt_br: Ir para o plano básico

source: Current
es: Actual
pt_br: Atual

source: Paid Plan
es: Plan pagado
pt_br: Plano pago

source: Monthly payments
es: Pagos mensuales
pt_br: Pagamentos mensais

source: Resubscribe
pt_br: Reinscrever

source: Modify
es: Modificar
pt_br: Modificar

source: Sign up
es: Regístrate
pt_br: inscrever-se

source: Trial
es: Prueba
pt_br: Tentar

source: days
es: días
pt_br: dias

source: Semiannual payments
es: Pagos semestrales
pt_br: Pagamentos semestrais

source: Annual payments
es: Pagos anuales
pt_br: Pagamentos anuais

source: Refunds and cancellation
es: Reembolsos y cancelaciones
pt_br: Reembolsos e cancelamentos

source: Subscriptions can be cancelled at any time. If a cancellation took place during the trial period, no charge will be made. Thereafter, subscriptions are charged in advance and no refunds will be made.
es: Las suscripciones se pueden cancelar en cualquier momento. Si la cancelación se produce durante el período de prueba, no se realizará ningún cargo. Posteriormente, las suscripciones se cobran por adelantado y no se realizarán reembolsos.
pt_br: As subscriçãoes podem ser canceladas a qualquer momento. Se um cancelamento ocorrer durante o periodo de teste, nenhuma cobrança será feita. Posteriormente, as assinaturas serão cobradas antecipadamente e nenhum reembolso será feito.

source: See
es: Ver
pt_br: Ver

source: Terms and Conditions
es: Términos y Condiciones
pt_br: Termos e Condições

source: Our order process is conducted by our online reseller Paddle.com. Paddle.com is the Merchant of Record for all our orders. Paddle provides all customer service inquiries and handles returns.
es: Nuestro proceso de pedido es realizado por nuestro revendedor en línea Paddle.com. La empresa Paddle.com es la comerciante de registro para todos nuestros pedidos. Paddle proporciona todas las consultas de servicio al cliente y maneja las devoluciones.
pt_br: Nosso processo de pedidos é conduzido pelo nosso revendedor on-line Paddle.com. Paddle.com é o comerciante de registro para todos os nossos pedidos. Paddle fornece todas as perguntas de atendimento ao cliente e lida com devoluções.

source: Unlimited documents
es: Documentos ilimitados
pt_br: Documentos ilimitados

source: Switch
es: Cambiar
pt_br: Trocar
