Repository: pypi-data/pypi-mirror-336
Catalog: packages/fiduswriter-payment-paddle/fiduswriter_payment_paddle-4.0.0.tar.gz/fiduswriter_payment_paddle-4.0.0/fiduswriter/payment/locale/*/LC_MESSAGES/djangojs.po
Languages: bg, fr

source: Subscription warning
bg: Предупреждение за абонамент
fr: Avertissement d'abonnement

source: You have run out of free documents. Sign up for a subscription to create more documents.
bg: Изчерпали сте безплатни документи. Регистрирайте се за абонамент, за да създадете още документи.
fr: Vous n'avez plus droit à un document gratuit. Inscrivez-vous à un abonnement pour créer plus de documents.

source: Go to subscription page
bg: Отидете на страницата за абонаменти
fr: Accéder à la page d'abonnement

source: Subscription
bg: абонамент
fr: Abonnement

source: Plan overview
bg: Преглед на плана
fr: Aperçu du forfait

source: Modify subscription
bg: Промяна на абонамента
fr: Modifier l'abonnement

source: Please choose whether to update payment details or to cancel your subscription.
bg: Моля, изберете дали да актуализирате данните за плащане или да анулирате абонамента си.
fr: Veuillez choisir entre mettre à jour les détails du paiement ou annuler votre abonnement.

source: Update payment details
bg: Актуализирайте данните за плащане
fr: Mettre à jour les détails du paiement

source: Cancel subscription
bg: Анулиране на абонамента
fr: Annuler l'abonnement

source: Plan change not possible
bg: Промяната на плана не е възможна
fr: Changement de forfait impossible

source: Unfortunately it is not possible to switch plans during the trial period.
bg: За съжаление не е възможно смяната на плановете през пробния период.
fr: Malheureusement, il n'est pas possible de changer de forfait pendant la période d'essai.

source: Switch subscription
bg: Превключване на абонамента
fr: Changer d'abonnement

source: Do you really want to switch your subscription type?
bg: Наистина ли искате да смените типа на абонамента си?
fr: Voulez-vous vraiment changer de type d'abonnement?

source: Yes
bg: да
fr: Oui

source: Pricing
bg: Ценообразуване
fr: Tarification

source: Pricing Guide
bg: Ръководство за ценообразуване
fr: Guide de prix

source: You can write 2 documents on the Free Plan without any trial period.
bg: Можете да напишете 2 документа на безплатния план без изпитателен период.
fr: Vous pouvez écrire 2 documents sur le forfait gratuit sans période d'essai.

source: If you want to write more documents, you can upgrade your plan below.
bg: Ако искате да напишете още документи, можете да надстроите плана си по-долу.
fr: Si vous souhaitez écrire plus de documents, vous pouvez mettre à jour votre forfait ci-dessous.

source: Basic
bg: Основен
fr: De base

source: Free Plan
bg: Безплатен план
fr: Forfait gratuit

source: 2 free documents
bg: 2 безплатни документа
fr: 2 documents gratuits

source: Unlimited collaborators
bg: Неограничени сътрудници
fr: Collaborateurs illimités

source: Unlimited bibliography items
bg: Неограничени библиографски елементи
fr: Articles de bibliographie illimités

source: Unlimited exports
bg: Неограничен износ
fr: Exportations illimitées

source: Default
bg: По подразбиране
fr: Défaut

source: Downgrade on
bg: Намаляване на
fr: Rétrograder sur

source: Current
bg: Текущ
fr: Courant

source: Paid Plan
bg: Платен план
fr: Forfait payant

source: Monthly payments
bg: Месечни плащания
fr: Mensualités

source: Resubscribe
bg: подновя абонамента си
fr: Se réinscrire

source: Modify
bg: Промени
fr: Modifier

source: Sign up
bg: Регистрирай се
fr: S'inscrire

source: Trial
bg: Пробен период
fr: Essai

source: days
bg: дни
fr: jours

source: Semiannual payments
bg: Полугодишни плащания
fr: Paiements semestriels

source: Annual payments
bg: Годишни плащания
fr: Paiements annuels

source: Refunds and cancellation
bg: Възстановяване на суми и анулиране
fr: Remboursements et annulation

source: Subscriptions can be cancelled at any time. If a cancellation took place during the trial period, no charge will be made. Thereafter, subscriptions are charged in advance and no refunds will be made.
bg: Абонаментите могат да бъдат анулирани по всяко време. Ако през пробния период се извърши анулиране, няма да бъде таксувано. След това абонаментите се таксуват предварително и няма да се възстановяват суми.
fr: Les abonnements peuvent être annulés à tout moment. Si une annulation a eu lieu pendant la période d'essai, aucuns frais ne seront facturés. Par la suite, les abonnements seront facturés à l'avance et aucun remboursement ne sera effectué.

source: See
bg: виждам
fr: Voir

source: Terms and Conditions
bg: Правила и условия
fr: Termes et conditions

source: Our order process is conducted by our online reseller Paddle.com. Paddle.com is the Merchant of Record for all our orders. Paddle provides all customer service inquiries and handles returns.
bg: Процесът на поръчка се провежда от нашия онлайн дистрибутор Paddle.com. Paddle.com е Търговският рекорд за всички наши поръчки. Paddle предоставя всички запитвания за обслужване на клиенти и обработва връщания.
fr: Notre processus de commande est mené par notre revendeur en ligne Paddle.com. Paddle.com est le marchand officiel de toutes nos commandes. Paddle répond à toutes les demandes de service client et gère les retours.

source: Unlimited documents
bg: Неограничени документи
fr: Documents illimités

source: Switch
bg: ключ
fr: Commutateur
